/* З текстового файлу зчитати послідовність записів, які містять дані про результати сесії студентів групи, організувавши послідовність структур в однозв’язний список у такому форматі: <Прізвище>, <Ім’я>, <Дата народження>, <Список екзаменаційних оцінок>. Роздрукувати введені дані у вигляді таблиці. Відсортувати студентів у алфавітному порядку за прізвищем. Реалізувати операцію вставки нового елемента у відсортований список і операцію вилучення зі списку студентів, які отримали на першому іспиті оцінку 2. Визначити двох найстарших студентів.*/

#include "single_func.h"

int main(){
    struct Node * pHead;
    
    ListInit(&pHead);
    
    int count = 0;
    
    count = FileScan("grade.txt", &pHead);
    printf("\nЗчитані дані з файлу, організовані в список: \n\n");
    PrintList(pHead);
    
    SortSurnameAlpha(&pHead, count);
    printf("\n");
    printf("\nВідсортований список за прізвищем: \n\n");
    PrintList(pHead);
    
    AddNewElemToList(&pHead, &count);
    printf("\n");
    printf("\nВідсортований список із новими (вставленими) елементами: \n\n");
    PrintList(pHead);
    
    DeleteBadStudents(&pHead, count);
    printf("\n");
    printf("\nВідсортований список без студентів, що отримали 2 на першому іспиті: \n\n");
    PrintList(pHead);
    
    SearchTwoOldestStudentsInList(&pHead, count);
    
    return 0;
}
